RIET/src/InformationRegisters/CoefficientsToTheRatesOfAgents/CoefficientsToTheRatesOfAgents.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CoefficientsToTheRatesOfAgents</name>
  <resources>
    <name>Coefficient1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Coefficient2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FixedSumForCoefficient</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Service</name>
    <type>
      <types>CatalogRef.Services</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/CoefficientsToTheRatesOfAgents/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Agent", Запись.Agent);
		Запрос.УстановитьПараметр("Service", Запись.Service);
		Запрос.УстановитьПараметр("StartDate", Запись.StartDate);
		Запрос.УстановитьПараметр("ExpiryDate", Запись.ExpiryDate);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	CoefficientsToTheRatesOfAgents.StartDate,
		               |	CoefficientsToTheRatesOfAgents.ExpiryDate
		               |ИЗ
		               |	РегистрСведений.CoefficientsToTheRatesOfAgents КАК CoefficientsToTheRatesOfAgents
		               |ГДЕ
		               |	CoefficientsToTheRatesOfAgents.Agent = &Agent
		               |	И CoefficientsToTheRatesOfAgents.Service = &Service
		               |	И (CoefficientsToTheRatesOfAgents.StartDate >= &StartDate
		               |				И CoefficientsToTheRatesOfAgents.StartDate < &ExpiryDate
		               |			ИЛИ CoefficientsToTheRatesOfAgents.ExpiryDate >= &StartDate
		               |				И CoefficientsToTheRatesOfAgents.ExpiryDate < &ExpiryDate)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"For Service " + СокрЛП(Запись.Service) + " and Agent " + СокрЛП(Запись.Agent) + " already exists setting 
				|with overlapping period: " + СокрЛП(Выборка.StartDate) + " - " + СокрЛП(Выборка.ExpiryDate),
				,,, Отказ);
		
		КонецЕсли;
		   		
	КонецЦикла;
	
КонецПроцедуры
